{


    "documents": [
      "The Industrial Revolution, which began in the late 18th century, marked a significant shift from agrarian and handicraft economies to industrialized and machine-based production. It originated in Britain and spread globally, transforming various sectors, including manufacturing, transportation, and agriculture. Key innovations during this period included the steam engine, textile machinery, and the rise of factories. The Industrial Revolution had profound socio-economic impacts, leading to urbanization, the growth of the working class, and changes in living standards. This transformative era laid the foundation for modern industrial societies.",
      
      "Genetic engineering involves the manipulation of an organism's DNA to achieve specific traits or characteristics. This technology has applications in agriculture, medicine, and various scientific fields. In agriculture, genetically modified crops are designed for improved yield, resistance to pests, and environmental adaptability. In medicine, gene therapy holds the potential to treat genetic disorders by correcting or replacing faulty genes. While genetic engineering offers numerous benefits, ethical concerns and potential environmental risks have prompted debates about its responsible use and regulation.",
      
      "The Renaissance, spanning the 14th to the 17th century, was a cultural and intellectual revival in Europe. It marked a transition from medieval to modern times, emphasizing humanism, art, science, and literature. Influential figures like Leonardo da Vinci, Michelangelo, and Galileo Galilei emerged during this period, contributing to advancements in art, astronomy, and other disciplines. The Renaissance had a profound impact on European society, fostering creativity, critical thinking, and the pursuit of knowledge.",
      
      "Globalization is the interconnectedness of economies, cultures, and societies on a global scale. It is driven by advancements in communication, transportation, and technology, facilitating 